#2. Создайте функцию, принимающую на вход 3 числа и возвращающую наибольшее из них.

list = [1,5,12]

def max_value(par1, par2, par3):
    return max(par1,par2,par3)

print(max_value(list[0],list[1],list[2]))

